src/main/resources/onvif/GetStreamUri.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/media/wsdl" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:sch="http://www.onvif.org/ver10/schema">
   ${header}

   <soap:Body>
      <wsdl:GetStreamUri>
         <wsdl:StreamSetup>
            <sch:Stream>0</sch:Stream>
            <sch:Transport>
               <sch:Protocol>RTSP</sch:Protocol>
               <!--Optional:-->
               <sch:Tunnel/>
            </sch:Transport>
            <!--You may enter ANY elements at this point-->
         </wsdl:StreamSetup>
         <wsdl:ProfileToken>${0}</wsdl:ProfileToken>
      </wsdl:GetStreamUri>
   </soap:Body>
</soap:Envelope>